conf/src/DataProcessors/ЭП_ВыгрузкаТрудозатратВExcel/ЭП_ВыгрузкаТрудозатратВExcel.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЭП_ВыгрузкаТрудозатратВExcel</name>
</mdclass:DataProcessor>

conf/src/InformationRegisters/ЭП_ОкладыСотрудников/ЭП_ОкладыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ОкладыСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ТаблицаГрейдов/ЭП_ТаблицаГрейдов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ТаблицаГрейдов</name>
  <resources>
    <name>От</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>До</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/AccumulationRegisters/УчетВремени/УчетВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетВремени</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УДАЛИТЬЭтап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехническийПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/InformationRegisters/ЭП_ВиртуальныеЭтапыПроектов/ЭП_ВиртуальныеЭтапыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ВиртуальныеЭтапыПроектов</name>
  <resources>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодБИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВиртуальныйЭтап</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВиртуальныйЭтапСсылка</name>
    <type>
      <types>CatalogRef.ЭП_ВиртуальныеЭтапы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Catalogs/ЭП_Сотрудники/ЭП_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ЭП_ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стажёр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наставник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ЭП_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСотрудника</name>
    <type>
      <types>EnumRef.ЭП_СтатусыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ЭП_ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ЭП_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРезюме</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПрофиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыИзЗУП</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВИПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботникВОфисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКодРевью</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдСотрудника</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбменеСЗУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчавствуетВПолученииОкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>ВидДостижения</name>
      <type>
        <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеПрофили</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/DataProcessors/ЭП_ВыгрузкаТрудозатратВExcel/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыгрузкаВExcel(ПараметрыВыполнения)
	
	Если НЕ ПроверитьЗаполнение() Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог = "";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Заголовок = "Выберите каталог"; 
	
	ОповещениеЗавершения = Новый ОписаниеОповещения("ПриВыбореКаталога", ЭтотОбъект);
	
	Диалог.Показать(ОповещениеЗавершения);
	
КонецПроцедуры 
  
&НаСервере
Функция ЗаполнитьТаблицуНаСервере(ТабДок) 
	
	ОбъектВнешнейОбработки = РеквизитФормыВЗначение("Объект");
	НовыйМакет = ОбъектВнешнейОбработки.ПолучитьМакет("Макет");
	ОбластьСтрока = НовыйМакет.ПолучитьОбласть("Строка");
	ОбластьШапкаТаблицы = НовыйМакет.ПолучитьОбласть("ШапкаТаблицы");

	Запрос = Новый Запрос(ТекстЗапросаДанныхПоСотрудникам()); 	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СписокПроектов", СписокПроектов.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ВИРВ", "ЯД");
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ПроверкаПроекта", НЕ СписокПроектов.Количество()> 0);
    УстановитьПривилегированныйРежим(Истина);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьСтрока);	
		
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаДанныхПоСотрудникам()

	Возврат "ВЫБРАТЬ
	        |	ЭП_Сотрудники.Ссылка КАК Ссылка
	        |ПОМЕСТИТЬ ВТ_ДоступныеСотрудники
	        |ИЗ
	        |	Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
	        |ГДЕ
	        |	ЭП_Сотрудники.Организация В(&СписокОрганизаций)
	        |	И НЕ ЭП_Сотрудники.ДоговорГПХ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЭП_ОкладыСотрудников.Сотрудник КАК Сотрудник,
	        |	ЭП_ТаблицаГрейдов.Грейд КАК Грейд,
	        |	ЭП_ОкладыСотрудников.Период КАК Период
	        |ПОМЕСТИТЬ ВТ_ГрейдыСотрудниковПоПериодам
	        |ИЗ
	        |	РегистрСведений.ЭП_ОкладыСотрудников КАК ЭП_ОкладыСотрудников
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ТаблицаГрейдов КАК ЭП_ТаблицаГрейдов
	        |		ПО ЭП_ОкладыСотрудников.Оклад >= ЭП_ТаблицаГрейдов.От
	        |			И ЭП_ОкладыСотрудников.Оклад <= ЭП_ТаблицаГрейдов.До
	        |ГДЕ
	        |	ЭП_ОкладыСотрудников.Сотрудник В
	        |			(ВЫБРАТЬ
	        |				ВТ_ДоступныеСотрудники.Ссылка КАК Ссылка
	        |			ИЗ
	        |				ВТ_ДоступныеСотрудники КАК ВТ_ДоступныеСотрудники)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_ГрейдыСотрудниковПоПериодамСлева.Сотрудник КАК Сотрудник,
	        |	ВТ_ГрейдыСотрудниковПоПериодамСлева.Грейд КАК Грейд,
	        |	ВТ_ГрейдыСотрудниковПоПериодамСлева.Период КАК ПериодНачало,
	        |	МИНИМУМ(ЕСТЬNULL(ВТ_ГрейдыСотрудниковПоПериодамСправа.Период, ДАТАВРЕМЯ(3999, 12, 31))) КАК ПериодОкончание
	        |ПОМЕСТИТЬ ВТ_ИнтервалыСГрейдамиПоСотрудникам
	        |ИЗ
	        |	ВТ_ГрейдыСотрудниковПоПериодам КАК ВТ_ГрейдыСотрудниковПоПериодамСлева
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГрейдыСотрудниковПоПериодам КАК ВТ_ГрейдыСотрудниковПоПериодамСправа
	        |		ПО ВТ_ГрейдыСотрудниковПоПериодамСлева.Период < ВТ_ГрейдыСотрудниковПоПериодамСправа.Период
	        |			И ВТ_ГрейдыСотрудниковПоПериодамСлева.Сотрудник = ВТ_ГрейдыСотрудниковПоПериодамСправа.Сотрудник
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_ГрейдыСотрудниковПоПериодамСлева.Сотрудник,
	        |	ВТ_ГрейдыСотрудниковПоПериодамСлева.Грейд,
	        |	ВТ_ГрейдыСотрудниковПоПериодамСлева.Период
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	УчетВремени.Период КАК Период,
	        |	УчетВремени.Пользователь КАК Пользователь,
	        |	УчетВремени.Проект КАК Проект,
	        |	УчетВремени.НомерСтроки КАК НомерСтроки,
	        |	ВЫБОР
	        |		КОГДА УчетВремени.ТехническийПроект = ЗНАЧЕНИЕ(Справочник.ТехническиеПроекты.ПустаяСсылка)
	        |			ТОГДА УчетВремени.Задача.Предмет.Владелец
	        |		ИНАЧЕ УчетВремени.ТехническийПроект.Владелец
	        |	КОНЕЦ КАК ПроектИзПредмета,
	        |	УчетВремени.Длительность / 3600 КАК Длительность,
	        |	УчетВремени.ОписаниеРаботы КАК ОписаниеРаботы,
	        |	ЭП_Сотрудники.Ссылка КАК Сотрудник,
	        |	ЭП_Сотрудники.ГрейдСотрудника КАК ГрейдСотрудника,
	        |	ЭП_Сотрудники.ТабельныйНомер КАК ТабельныйНомер,
	        |	ВЫБОР
	        |		КОГДА УчетВремени.ТехническийПроект = ЗНАЧЕНИЕ(Справочник.ТехническиеПроекты.ПустаяСсылка)
	        |			ТОГДА УчетВремени.Задача.Предмет
	        |		ИНАЧЕ УчетВремени.ТехническийПроект
	        |	КОНЕЦ КАК Предмет,
	        |	ЭП_Сотрудники.Наименование КАК ФИО
	        |ПОМЕСТИТЬ ВТ_ПодготовленныеДанныеУчетаВремени
	        |ИЗ
	        |	РегистрНакопления.УчетВремени КАК УчетВремени
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
	        |		ПО УчетВремени.Пользователь.ЭП_Сотрудник = ЭП_Сотрудники.Ссылка
	        |ГДЕ
	        |	(&ПроверкаПроекта
	        |			ИЛИ УчетВремени.Проект В (&СписокПроектов))
	        |	И УчетВремени.Период МЕЖДУ &НачалоПериода И &КонецПериода
	        |	И ЭП_Сотрудники.Ссылка В
	        |			(ВЫБРАТЬ
	        |				ВТ_ДоступныеСотрудники.Ссылка КАК Ссылка
	        |			ИЗ
	        |				ВТ_ДоступныеСотрудники КАК ВТ_ДоступныеСотрудники)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА ЭП_ВиртуальныеЭтапыПроектов.КодБИ ЕСТЬ NULL
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_ПодготовленныеДанныеУчетаВремени.Предмет.РазделПроекта.ЭП_КодBI = """"
	        |						ТОГДА ВТ_ПодготовленныеДанныеУчетаВремени.ПроектИзПредмета.ЭП_КодBI
	        |					ИНАЧЕ ВТ_ПодготовленныеДанныеУчетаВремени.Предмет.РазделПроекта.ЭП_КодBI
	        |				КОНЕЦ
	        |		ИНАЧЕ ЭП_ВиртуальныеЭтапыПроектов.КодБИ
	        |	КОНЕЦ КАК Проект,
	        |	ВТ_ПодготовленныеДанныеУчетаВремени.Период КАК ДатаУчета,
	        |	ВТ_ПодготовленныеДанныеУчетаВремени.ТабельныйНомер КАК EMPLOYEE_ID,
	        |	ЕСТЬNULL(ВТ_ИнтервалыСГрейдамиПоСотрудникам.Грейд, ВТ_ПодготовленныеДанныеУчетаВремени.ГрейдСотрудника) КАК Грейд,
	        |	СУММА(ВТ_ПодготовленныеДанныеУчетаВремени.Длительность) КАК ЧасыРаботы,
	        |	ВТ_ПодготовленныеДанныеУчетаВремени.ФИО КАК ФИО_Сотрудника,
	        |	ВТ_ПодготовленныеДанныеУчетаВремени.ОписаниеРаботы КАК Описание_Задач,
	        |	&ВИРВ КАК ВИРВ,
	        |	ЭП_Сотрудники.Организация.КодBI КАК Компания
	        |ИЗ
	        |	ВТ_ПодготовленныеДанныеУчетаВремени КАК ВТ_ПодготовленныеДанныеУчетаВремени
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнтервалыСГрейдамиПоСотрудникам КАК ВТ_ИнтервалыСГрейдамиПоСотрудникам
	        |		ПО ВТ_ПодготовленныеДанныеУчетаВремени.Период >= ВТ_ИнтервалыСГрейдамиПоСотрудникам.ПериодНачало
	        |			И ВТ_ПодготовленныеДанныеУчетаВремени.Период < ВТ_ИнтервалыСГрейдамиПоСотрудникам.ПериодОкончание
	        |			И ВТ_ПодготовленныеДанныеУчетаВремени.Сотрудник = ВТ_ИнтервалыСГрейдамиПоСотрудникам.Сотрудник
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ВиртуальныеЭтапыПроектов КАК ЭП_ВиртуальныеЭтапыПроектов
	        |		ПО ВТ_ПодготовленныеДанныеУчетаВремени.ПроектИзПредмета = ЭП_ВиртуальныеЭтапыПроектов.Проект
	        |			И (ВТ_ПодготовленныеДанныеУчетаВремени.Период >= НАЧАЛОПЕРИОДА(ЭП_ВиртуальныеЭтапыПроектов.ДатаС, ДЕНЬ))
	        |			И (ВТ_ПодготовленныеДанныеУчетаВремени.Период <= КОНЕЦПЕРИОДА(ЭП_ВиртуальныеЭтапыПроектов.ДатаПо, ДЕНЬ))
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭП_Сотрудники КАК ЭП_Сотрудники
	        |		ПО ВТ_ПодготовленныеДанныеУчетаВремени.Сотрудник = ЭП_Сотрудники.Ссылка
	        |ГДЕ
	        |	НЕ ВТ_ПодготовленныеДанныеУчетаВремени.ПроектИзПредмета.ЭП_НеУчаствуетВBI
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЭП_Сотрудники.Организация.КодBI,
	        |	ВТ_ПодготовленныеДанныеУчетаВремени.ОписаниеРаботы,
	        |	ВТ_ПодготовленныеДанныеУчетаВремени.ФИО,
	        |	ЕСТЬNULL(ВТ_ИнтервалыСГрейдамиПоСотрудникам.Грейд, ВТ_ПодготовленныеДанныеУчетаВремени.ГрейдСотрудника),
	        |	ВТ_ПодготовленныеДанныеУчетаВремени.ТабельныйНомер,
	        |	ВТ_ПодготовленныеДанныеУчетаВремени.Период,
	        |	ВЫБОР
	        |		КОГДА ЭП_ВиртуальныеЭтапыПроектов.КодБИ ЕСТЬ NULL
	        |			ТОГДА ВЫБОР
	        |					КОГДА ВТ_ПодготовленныеДанныеУчетаВремени.Предмет.РазделПроекта.ЭП_КодBI = """"
	        |						ТОГДА ВТ_ПодготовленныеДанныеУчетаВремени.ПроектИзПредмета.ЭП_КодBI
	        |					ИНАЧЕ ВТ_ПодготовленныеДанныеУчетаВремени.Предмет.РазделПроекта.ЭП_КодBI
	        |				КОНЕЦ
	        |		ИНАЧЕ ЭП_ВиртуальныеЭтапыПроектов.КодБИ
	        |	КОНЕЦ";	

КонецФункции

&НаКлиенте
Процедура ПриВыбореКаталога(ВыбКаталог, ДополнительныеПараметры) Экспорт
	
	Если НЕ ВыбКаталог = Неопределено Тогда
	   
	   ПапкаЗагрузки = ВыбКаталог[0];
	   
	   ИмяФайла = СтрШаблон("Выгрузка_данных_по_сотрудникам %1", Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd-hh-mm; ДЛФ=DT"));  
	   
	   ТабДок = Новый ТабличныйДокумент;
	   
	   ПолноеИмяФайла = ПапкаЗагрузки + ПолучитьРазделительПути() + ИмяФайла + ".xlsx"; 
	   
	   ЗаполнитьТаблицуНаСервере(ТабДок);
	   
	   ТабДок.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.xlsx);
	   
	   ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка данных успешно завершена");
	   
   КонецЕсли;
   
КонецПроцедуры
